# HangerWidthOutOfRange Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..HangerWidthOutOfRange Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The hanger width is too large to show.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HangerWidthOutOfRange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HangerWidthOutOfRange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HangerWidthOutOfRange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace